import seedRedis from "~~/server/utils/seeds/seed-redis"

export default defineNitroPlugin(async (nitroApp) => {
  console.log("🚀 Серверный плагин запущен! Начинаем инициализацию данных...");
  try {
    seedRedis.seed()
    // Здесь может быть любая другая логика:
    // - Подключение к другим базам данных
    // - "Прогрев" кэша с данными о компаниях из MongoDB
    // - Запуск фоновых задач
  } catch (error) {
    console.error(
      "❌ Ошибка во время выполнения серверного плагина инициализации:",
      error
    );
  }
});
